Конфигурация/Documents/ИзменениеУсловийСделки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ИзменениеУсловийСделки</Name>
			<BasedOn>
				<xr:Item>Document.Сделка</xr:Item>
				<xr:Item>Document.СделкаРЕПО</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.БухПартииЦенныхБумагКПолучению</xr:Item>
				<xr:Item>InformationRegister.УсловияСделокРЕПО</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствам</xr:Item>
				<xr:Item>InformationRegister.УсловияСделок</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>InformationRegister.ОперацииСЦеннымиБумагами</xr:Item>
				<xr:Item>AccountingRegister.ЕдиныйБухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.БухПартииЦенныхБумагКупленныеПоРЕПО</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностиПоЦеннымБумагам</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностиПоВторойЧастиРЕПО</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СделкаРЕПО</v8:Type>
						<v8:Type>cfg:DocumentRef.Сделка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗадолженности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рынок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВторойЧастиРЕПО</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобственныйКурсОплаты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>25</v8:Digits>
							<v8:FractionDigits>20</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвратныйКупонКЗачету</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаЗадолженностиПоКупону</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЗаймаКПогашениюВВалютеСделки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлатежноеУсловиеСделки</Name>
					<Comment>Для внебиржевых сделок</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаРЕПО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЦенныеБумаги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Исполнено</Name>
							<Comment>Исполнено в части поставки</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДепозитарныйСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДепозитарныеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦена</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаПроцент</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦенаПроцент</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаКупона</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦена</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКупона</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Enums/РынкиЦенныхБумаг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>РынкиЦенныхБумаг</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Акции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Облигации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Паи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Векселя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закладные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИпотечныеСертификатыУчастия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДепозитарныеРасписки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Фьючерсы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Опционы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВалютныеПары</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доли</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДрагоценныеМеталлы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Documents/ПогашениеКупона.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ПогашениеКупона</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствам</xr:Item>
				<xr:Item>AccumulationRegister.БухПартииЦенныхБумагПроданныеВРепо</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>InformationRegister.ОперацииСЦеннымиБумагами</xr:Item>
				<xr:Item>AccountingRegister.ЕдиныйБухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.БухПартииЦенныхБумаг</xr:Item>
				<xr:Item>AccumulationRegister.БухПартииЦенныхБумагКупленныеПоРЕПО</xr:Item>
				<xr:Item>AccountingRegister.НалоговыйУчет</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Облигация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Облигации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФиксации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличествоЦелое</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНаОднуОблигацию</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦена</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНаОднуОблигациюВВалютеОплаты</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦена</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКупона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКупонаВВалютеОплаты</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Брокер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Documents/ИзменениеУсловийСделки/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЗаполнитьУсловияСделкиПредЗначениями()
	
	// скопируем реквизиты шапки
	Объект.ДатаВторойЧастиРЕПО   = ЭтаФорма.ПредДатаВторойЧастиРЕПО;
	Объект.ВалютаОплаты          = ЭтаФорма.ПредВалютаОплаты;
	Объект.ДатаИсполнения        = ЭтаФорма.ПредДатаИсполнения;
	Объект.ДатаОплаты            = ЭтаФорма.ПредДатаОплаты;
	Объект.ДатаПоставки          = ЭтаФорма.ПредДатаПоставки;
	Объект.КурсОплаты            = ЭтаФорма.ПредКурсОплаты;
	Объект.СобственныйКурсОплаты = ЭтаФорма.ПредСобственныйКурсОплаты;
	Объект.СтавкаРЕПО          	 = ЭтаФорма.ПредСтавкаРЕПО;
	
	// скопируем реквизиты табличной части
	Объект.ЦенныеБумаги.Очистить();
	
	Для каждого СтрокаПредЦенныеБумаги Из ЭтаФорма.ПредЦенныеБумаги Цикл
		ЗаполнитьЗначенияСвойств(Объект.ЦенныеБумаги.Добавить(), СтрокаПредЦенныеБумаги);
	КонецЦикла;
	
	НастроитьВидимостьИДоступность(ЭтаФорма); // т.к. валюта оплаты могла измениться
	
КонецПроцедуры // ЗаполнитьУсловияСделкиПредЗначениями

&НаКлиенте
Процедура ЗаполнитьДокументНаОсновании(ТолькоПредУсловия = Ложь)
	
	Если Не ТолькоПредУсловия Тогда
		// если основание выбрано, безусловно обновим денормализорванные поля шапки
		Если ЗначениеЗаполнено(Объект.Основание) Тогда
			РеквизитыОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Основание,
				"Организация, СчетДоверительногоУправления, Рынок, ВалютаСделки");
				
			ЗаполнитьЗначенияСвойств(Объект, РеквизитыОснования);
			
			ОпределитьДоступныеВидыЗадолженности(ЭтаФорма);
			
		Иначе	
			// очистим зависимые реквизиты
			Объект.Организация                  = Неопределено;
			Объект.СчетДоверительногоУправления = Неопределено;
			Объект.Рынок                        = Неопределено;
			
			Объект.ЦенныеБумаги.Очистить();
			
			Элементы.ВидЗадолженности.СписокВыбора.Очистить();
			
		КонецЕсли;
		
		ОпределитьРежимИсполненияСделки(ЭтаФорма);
		
		Элементы.ЦенныеБумагиЦеннаяБумага.ОграничениеТипа     = РаботаСЦеннымиБумагамиКлиентСервер.ТипЦеннойБумагиВЗависимостиОтРынка(Объект.Рынок);
		Элементы.ПредЦенныеБумагиЦеннаяБумага.ОграничениеТипа = РаботаСЦеннымиБумагамиКлиентСервер.ТипЦеннойБумагиВЗависимостиОтРынка(Объект.Рынок);
		
		ЗаполнитьОписаниеСделкиНаСервере();
	КонецЕсли;
	
	// пред. условия сделки также обновим без вопросов
	ОбновитьПредУсловияСделкиНаСервере();
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
	// а вот обновлять новые условия сделки, доступные для изменения,
	// согласно новой концепции, будем только после вопроса
	Если ЗначениеЗаполнено(Объект.Основание) И ЗначениеЗаполнено(Объект.ВидЗадолженности) Тогда
		Если Вопрос("Обновить новые условия сделки (текущие значения при этом будут потеряны)?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			ЗаполнитьУсловияСделкиПредЗначениями();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьДокументНаОсновании

&НаКлиентеНаСервереБезКонтекста
Процедура ОпределитьРежимИсполненияСделки(Форма)
	
	Основание        = Форма.Объект.Основание;
	ВидЗадолженности = Форма.Объект.ВидЗадолженности;
	
	Если Не ЗначениеЗаполнено(Основание) Или Не ЗначениеЗаполнено(ВидЗадолженности) Тогда
		Возврат;
	КонецЕсли;
	
	ТипОснования = ТипЗнч(Основание);
	
	Если      ТипОснования = Тип("ДокументСсылка.Сделка") Тогда
		ДанныеОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Основание, "ВалютаСделки, ОтложенноеИсполнение, РаздельноеИсполнение");
		ЗаполнитьЗначенияСвойств(Форма, ДанныеОснования);
		
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.СделкаРЕПО") Тогда
		Если      ВидЗадолженности = ПредопределенноеЗначение("Справочник.ВидыЗадолженности.ПоПервойЧастиРЕПО") Тогда
			ДанныеОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Основание, "ВалютаСделки, ОтложенноеИсполнение, РаздельноеИсполнение");
			ЗаполнитьЗначенияСвойств(Форма, ДанныеОснования);
			
		ИначеЕсли ВидЗадолженности = ПредопределенноеЗначение("Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО") Тогда
			ДанныеОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Основание, "ВалютаСделки, ОтложенноеИсполнениеВторойЧасти, РаздельноеИсполнениеВторойЧасти");
			
			Форма.ВалютаСделки         = ДанныеОснования.ВалютаСделки;
			Форма.ОтложенноеИсполнение = ДанныеОснования.ОтложенноеИсполнениеВторойЧасти;
			Форма.РаздельноеИсполнение = ДанныеОснования.РаздельноеИсполнениеВторойЧасти;
			
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры // ОпределитьРежимИсполненияСделки

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьИДоступность(Форма)
	
	Элементы      = Форма.Элементы;
	ДанныеОбъекта = Форма.Объект;
	
	// рынок облигаций
	ЭтоРынокОблигаций = (ДанныеОбъекта.Рынок = ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Облигации"));
	
	Элементы.ЦенныеБумагиЦенаПроцент.Видимость = ЭтоРынокОблигаций;
	Элементы.ЦенныеБумагиЦенаКупона.Видимость  = ЭтоРынокОблигаций;
	Элементы.ЦенныеБумагиСуммаКупона.Видимость = ЭтоРынокОблигаций;
	Элементы.ЦенныеБумагиСуммаВсего.Видимость  = ЭтоРынокОблигаций;
	
	Элементы.ПредЦенныеБумагиЦенаПроцент.Видимость = ЭтоРынокОблигаций;
	Элементы.ПредЦенныеБумагиЦенаКупона.Видимость  = ЭтоРынокОблигаций;
	Элементы.ПредЦенныеБумагиСуммаКупона.Видимость = ЭтоРынокОблигаций;
	Элементы.ПредЦенныеБумагиСуммаВсего.Видимость  = ЭтоРынокОблигаций;
	
	// режимы и даты исполнения
	Элементы.РаздельноеИсполнение.Видимость = Форма.ОтложенноеИсполнение;
	
	Элементы.ДатаИсполнения.Видимость = Форма.ОтложенноеИсполнение И Не Форма.РаздельноеИсполнение;
	Элементы.ДатаОплаты.Видимость     = Форма.РаздельноеИсполнение;
	Элементы.ДатаПоставки.Видимость   = Форма.РаздельноеИсполнение;
	Элементы.ВалютаОплаты.Видимость   = Форма.РаздельноеИсполнение;
	
	Элементы.РаздельноеИсполнение.Видимость = Форма.ОтложенноеИсполнение;
	
	Элементы.ПредДатаИсполнения.Видимость = Форма.ОтложенноеИсполнение И Не Форма.РаздельноеИсполнение;
	Элементы.ПредДатаОплаты.Видимость     = Форма.РаздельноеИсполнение;
	Элементы.ПредДатаПоставки.Видимость   = Форма.РаздельноеИсполнение;
	Элементы.ПредВалютаОплаты.Видимость   = Форма.РаздельноеИсполнение;
	
	Элементы.ПредДатаВторойЧастиРЕПО.Видимость = (ТипЗнч(ДанныеОбъекта.Основание) = Тип("ДокументСсылка.СделкаРЕПО"));
	Элементы.ДатаВторойЧастиРепо.Видимость	   = (ТипЗнч(ДанныеОбъекта.Основание) = Тип("ДокументСсылка.СделкаРЕПО"));
	Элементы.ПредСтавкаРЕПО.Видимость = (ТипЗнч(ДанныеОбъекта.Основание) = Тип("ДокументСсылка.СделкаРЕПО"));
	Элементы.СтавкаРепо.Видимость	   = (ТипЗнч(ДанныеОбъекта.Основание) = Тип("ДокументСсылка.СделкаРЕПО"));
	
	// курс оплаты
	ВидимостьСобственногоКурса = ЗначениеЗаполнено(Форма.ВалютаСделки) И ЗначениеЗаполнено(ДанныеОбъекта.ВалютаОплаты)
		И Форма.ВалютаСделки <> ДанныеОбъекта.ВалютаОплаты;
	
	Элементы.СобственныйКурсОплаты.Видимость = ВидимостьСобственногоКурса;
	Элементы.КурсОплаты.Видимость            = ВидимостьСобственногоКурса;
	
	
	ВидимостьПредСобственногоКурса = ЗначениеЗаполнено(Форма.ВалютаСделки) И ЗначениеЗаполнено(Форма.ПредВалютаОплаты)
		И Форма.ВалютаСделки <> Форма.ПредВалютаОплаты;
	
	Элементы.ПредСобственныйКурсОплаты.Видимость = ВидимостьПредСобственногоКурса;
	Элементы.ПредКурсОплаты.Видимость            = ВидимостьПредСобственногоКурса;
	
	// вид задолженности
	Элементы.ВидЗадолженности.Доступность = (ТипЗнч(ДанныеОбъекта.Основание) = Тип("ДокументСсылка.СделкаРЕПО"));
	
	//возвратный купон
	Элементы.ГруппаВозвратныйКупонРЕПО.Видимость = (ТипЗнч(ДанныеОбъекта.Основание) = Тип("ДокументСсылка.СделкаРЕПО"));
	Элементы.ГруппаВалютаКупона.Видимость = ДанныеОбъекта.ВозвратныйКупонКЗачету <> 0;	
	Форма.ЗачестьВозвратныйКупон = ДанныеОбъекта.ВозвратныйКупонКЗачету <> 0; 
	
	// валюта сделки
	Элементы.ГруппаВалютаСделки.Видимость = (ДанныеОбъекта.ВозвратныйКупонКЗачету <> 0) И ДанныеОбъекта.ВалютаОплаты <> ДанныеОбъекта.ВалютаЗадолженностиПоКупону;
	
КонецПроцедуры // НастроитьВидимостьДоступность

&НаКлиентеНаСервереБезКонтекста
Процедура ОпределитьДоступныеВидыЗадолженности(Форма)
	
	ДанныеОбъекта = Форма.Объект;
	
	ВидЗадолженностиСписокВыбора = Форма.Элементы.ВидЗадолженности.СписокВыбора;
	ВидЗадолженностиСписокВыбора.Очистить();
	
	// ограничем список выбора вида задолженности
	Если      ТипЗнч(ДанныеОбъекта.Основание) = Тип("ДокументСсылка.Сделка") Тогда
		НовыйВидЗадолженности = ПредопределенноеЗначение("Справочник.ВидыЗадолженности.ПоСделке");
		
		ВидЗадолженностиСписокВыбора.Добавить(НовыйВидЗадолженности);
		
		Если ДанныеОбъекта.ВидЗадолженности <> НовыйВидЗадолженности Тогда
			ДанныеОбъекта.ВидЗадолженности = НовыйВидЗадолженности;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДанныеОбъекта.Основание) = Тип("ДокументСсылка.СделкаРЕПО") Тогда
		ЧастьСделкиРЕПО = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеОбъекта.Основание, "ЧастьСделкиРЕПО");
		
		Если ЧастьСделкиРЕПО = 2 Тогда
			НовыйВидЗадолженности = ПредопределенноеЗначение("Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО");
			
			ВидЗадолженностиСписокВыбора.Добавить(НовыйВидЗадолженности);
			
			Если ДанныеОбъекта.ВидЗадолженности <> НовыйВидЗадолженности Тогда
				ДанныеОбъекта.ВидЗадолженности = НовыйВидЗадолженности;
			КонецЕсли;
			
		Иначе
			ВидЗадолженностиСписокВыбора.Добавить(ПредопределенноеЗначение("Справочник.ВидыЗадолженности.ПоПервойЧастиРЕПО"));
			ВидЗадолженностиСписокВыбора.Добавить(ПредопределенноеЗначение("Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО"));
			
			Если ВидЗадолженностиСписокВыбора.НайтиПоЗначению(ДанныеОбъекта.ВидЗадолженности) = Неопределено Тогда
				ДанныеОбъекта.ВидЗадолженности = Неопределено;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ОпределитьДоступныеВидыЗадолженности


&НаСервере
Процедура ЗаполнитьИнфПоляКорзиныЦенныхБумагНаСервере(ИмяКорзиныЦенныхБумаг)
	
	Если      ВРег(ИмяКорзиныЦенныхБумаг) = ВРег("ЦенныеБумаги") Тогда
		ДанныеКорзиныЦенныхБумаг = Объект.ЦенныеБумаги;
	ИначеЕсли ВРег(ИмяКорзиныЦенныхБумаг) = ВРег("ПредЦенныеБумаги") Тогда
		ДанныеКорзиныЦенныхБумаг = ЭтаФорма.ПредЦенныеБумаги;
	КонецЕсли;
	
	ДанныеКорзиныЦенныхБумаг.Загрузить(
		РаботаСЦеннымиБумагами.ЗаполнитьНоминалыИСуммыВсегоВТаблице(
			ДанныеКорзиныЦенныхБумаг.Выгрузить(), Объект.Дата));
	
	РаботаСКорзинойЦенныхБумагКлиентСервер.ЗаполнитьИтоговуюСтроку(Элементы["ИтоговаяСтрока" + ИмяКорзиныЦенныхБумаг], Объект.Рынок, ДанныеКорзиныЦенныхБумаг);
	
КонецПроцедуры // ЗаполнитьИнфПоляКорзиныЦенныхБумагНаСервере

&НаСервере
Процедура ОбновитьПредУсловияСделкиНаСервере()
	
	ПоляШапки = "ВалютаОплаты, ДатаИсполнения, ДатаОплаты, ДатаПоставки, КурсОплаты, СобственныйКурсОплаты, ПлатежноеУсловиеСделки";
	ПоляШапки = ПоляШапки + ?(ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.СделкаРепо"),",ДатаВторойЧастиРЕПО, СтавкаРЕПО","");
	ПоляШапки = СтрЗаменить(ПоляШапки, ",", Символы.ПС);
	
	// по возможности, заполним ранее не заполненные объекты
	Если ЗначениеЗаполнено(Объект.Основание) И ЗначениеЗаполнено(Объект.ВидЗадолженности) Тогда
		ПредУсловияСделки = Документы.ИзменениеУсловийСделки.ПолучитьУсловияСделки(Объект.Дата, Объект.Основание, Объект.ВидЗадолженности);
		
		ЭтаФорма.ПредЦенныеБумаги.Загрузить(ПредУсловияСделки);
			
		ЗаполнитьИнфПоляКорзиныЦенныхБумагНаСервере("ПредЦенныеБумаги");
				
		Если ПредУсловияСделки.Количество() > 0 Тогда
			Для НомСтр = 1 По СтрЧислоСтрок(ПоляШапки) Цикл
				ИмяПоля           = СокрЛП(СтрПолучитьСтроку(ПоляШапки, НомСтр));
				ПредУсловиеСделки = ПредУсловияСделки[0];
				
				ЭтаФорма["Пред" + ИмяПоля] = ПредУсловиеСделки[ИмяПоля];
			КонецЦикла;
		КонецЕсли;
		
	Иначе
		ЭтаФорма.ПредЦенныеБумаги.Очистить();
		
		// очистим ранее заполненные условия
		Для НомСтр = 1 По СтрЧислоСтрок(ПоляШапки) Цикл
			ЭтаФорма["Пред" + СокрЛП(СтрПолучитьСтроку(ПоляШапки, НомСтр))] = Неопределено;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры // ОбновитьПредУсловияСделкиНаСервере

&НаСервере
Процедура ЗаполнитьОписаниеСделкиНаСервере()
	
	Если Не ЗначениеЗаполнено(Объект.Основание) Тогда
		Элементы.НадписьОписаниеОснования.Заголовок = "";
		Возврат;
	КонецЕсли;
	
	// :)) ЗАО "ЮКОС-М", ММВБ, Акции, RUB, брокер БК "РЕГИОН", контрагент Василий Пупкин
	ТекстНадписи = "" + Объект.СчетДоверительногоУправления + ", " + Объект.Основание.МестоХранения + ", " + Объект.Рынок + ", " + ЭтаФорма.ВалютаСделки
		+ ?(ЗначениеЗаполнено(Объект.Основание.Брокер), ", брокер " + Объект.Основание.Брокер, ", собственная")
		+ ?(ЗначениеЗаполнено(Объект.Основание.Контрагент), ", контрагент " + Объект.Основание.Контрагент, "");
	
	Элементы.НадписьОписаниеОснования.Заголовок = ТекстНадписи;
	
КонецПроцедуры // ЗаполнитьОписаниеСделкиНаСервере

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	ЭтаФорма.КорзинаЦенныхБумаг = Истина; // в данном документе других вариантов нет
	
	ОпределитьРежимИсполненияСделки(ЭтаФорма);
	ОпределитьДоступныеВидыЗадолженности(ЭтаФорма);
	ЗаполнитьОписаниеСделкиНаСервере();
	
	Объект.ЦенныеБумаги.Загрузить(
		РаботаСЦеннымиБумагами.ЗаполнитьНоминалыИСуммыВсегоВТаблице(
			Объект.ЦенныеБумаги.Выгрузить(), Объект.Дата));
			
	ОбновитьПредУсловияСделкиНаСервере();
		
	РаботаСКорзинойЦенныхБумагКлиентСервер.ЗаполнитьИтоговуюСтроку(Элементы.ИтоговаяСтрокаЦенныеБумаги, Объект.Рынок, Объект.ЦенныеБумаги);
	РаботаСКорзинойЦенныхБумагКлиентСервер.ЗаполнитьИтоговуюСтроку(Элементы.ИтоговаяСтрокаПредЦенныеБумаги, Объект.Рынок, ЭтаФорма.ПредЦенныеБумаги);
	
	Элементы.ЦенныеБумагиЦеннаяБумага.ОграничениеТипа     = РаботаСЦеннымиБумагамиКлиентСервер.ТипЦеннойБумагиВЗависимостиОтРынка(Объект.Рынок);
	Элементы.ПредЦенныеБумагиЦеннаяБумага.ОграничениеТипа = РаботаСЦеннымиБумагамиКлиентСервер.ТипЦеннойБумагиВЗависимостиОтРынка(Объект.Рынок);
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
	ОбновитьВидимостьГруппыСуммаВВалютеСделки();
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПодтверждениеОперацииНаСервере()
	РаботаСДокументами.ЗаполнитьПодтверждениеОперации(ЭтаФорма, Объект.Ссылка);		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВалютаОплатыПогашенияКупона(СделкаРЕПО)
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	СделкаРЕПОЦенныеБумаги.Ссылка КАК Ссылка,
	                      |	МАКСИМУМ(СделкаРЕПОЦенныеБумаги.НомерСтроки) КАК НомерСтроки
	                      |ПОМЕСТИТЬ _СделкаРЕПО
	                      |ИЗ
	                      |	Документ.СделкаРЕПО.ЦенныеБумаги КАК СделкаРЕПОЦенныеБумаги
	                      |ГДЕ
	                      |	СделкаРЕПОЦенныеБумаги.Ссылка = &Ссылка
	                      |	И ВЫБОР
	                      |			КОГДА СделкаРЕПОЦенныеБумаги.Ссылка.МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)
	                      |				ТОГДА СделкаРЕПОЦенныеБумаги.Ссылка.ЧастьСделкиРЕПО = 0
	                      |			ИНАЧЕ СделкаРЕПОЦенныеБумаги.Ссылка.ЧастьСделкиРЕПО = 1
	                      |		КОНЕЦ
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	СделкаРЕПОЦенныеБумаги.Ссылка
	                      |
	                      |ИМЕЮЩИЕ
	                      |	МАКСИМУМ(СделкаРЕПОЦенныеБумаги.НомерСтроки) = 1
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	_СделкаРЕПО.Ссылка КАК Ссылка,
	                      |	_СделкаРЕПО.Ссылка.Организация КАК Организация,
	                      |	_СделкаРЕПО.Ссылка.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	                      |	СделкаРЕПОЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага
	                      |ПОМЕСТИТЬ _ЦенныеБумагиСделкиРЕПО
	                      |ИЗ
	                      |	_СделкаРЕПО КАК _СделкаРЕПО
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СделкаРЕПО.ЦенныеБумаги КАК СделкаРЕПОЦенныеБумаги
	                      |		ПО _СделкаРЕПО.Ссылка = СделкаРЕПОЦенныеБумаги.Ссылка
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	                      |	ПогашениеКупона.ВалютаОплаты КАК ВалютаОплаты,
	                      |	_ЦенныеБумагиСделкиРЕПО.ЦеннаяБумага КАК ЦеннаяБумага
	                      |ИЗ
	                      |	_ЦенныеБумагиСделкиРЕПО КАК _ЦенныеБумагиСделкиРЕПО
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПогашениеКупона КАК ПогашениеКупона
	                      |		ПО _ЦенныеБумагиСделкиРЕПО.Организация = ПогашениеКупона.Организация
	                      |			И _ЦенныеБумагиСделкиРЕПО.СчетДоверительногоУправления = ПогашениеКупона.СчетДоверительногоУправления
	                      |			И _ЦенныеБумагиСделкиРЕПО.ЦеннаяБумага = ПогашениеКупона.Облигация
	                      |			И (ПогашениеКупона.Проведен)
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ПогашениеКупона.Дата УБЫВ");
	
	Запрос.УстановитьПараметр("Ссылка", СделкаРЕПО);
		
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат СделкаРЕПО.ЦенныеБумаги[0].ЦеннаяБумага.ВалютаНоминала;
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		
		Возврат Выборка.ВалютаОплаты;
		
	КонецЕсли;
	
КонецФункции

Процедура ОбновитьВидимостьГруппыСуммаВВалютеСделки()
	
	Если ВалютаСделки <> Объект.ВалютаЗадолженностиПоКупону Тогда
		Элементы.ГруппаВалютаСделки.Видимость = ЭтаФорма.ЗачестьВозвратныйКупон;
	Иначе
		Элементы.ГруппаВалютаСделки.Видимость = Ложь;	
	КонецЕсли;
	
КонецПроцедуры

#Область ОБРАБОТЧИКИ_СОБЫТИЙ_ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// после записи теряются значения реквизитов, добавленных к т.ч. объекта
	Если ЭтаФорма.КорзинаЦенныхБумаг Тогда
		ЗаполнитьИнфПоляКорзиныЦенныхБумагНаСервере("ЦенныеБумаги");
		ЗаполнитьИнфПоляКорзиныЦенныхБумагНаСервере("ПредЦенныеБумаги");
	КонецЕсли;
	
	ЗаполнитьПодтверждениеОперацииНаСервере();			
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	РаботаСЖурналамиОперацийКлиентСервер.ОповеститьЖурналыОбИзменении();
	
	РаботаСДокументамиКлиент.ПроверитьПараметрыПодтвержденияОперации(ЭтаФорма, Объект, ПараметрыЗаписи);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ПодтверждениеОперации" Тогда
		Если Параметр = Объект.Ссылка
			ИЛИ (ТипЗнч(Параметр) = Тип("Массив") И Параметр.Найти(Объект.Ссылка) <> Неопределено)
		Тогда
			ЗаполнитьПодтверждениеОперациинаСервере();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОБРАБОТЧИКИ_СОБЫТИЙ_ЭЛЕМЕНТОВ_ФОРМЫ

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Объект.Дата = РаботаСДокументами.ПолучитьВремяДокумента(Объект.Дата, Объект.Ссылка);
	
	РаботаСКорзинойЦенныхБумагКлиентСервер.ПриИзмененииДаты(ЭтаФорма);
	
	ЗаполнитьДокументНаОсновании(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОснованиеПриИзменении(Элемент)
	
	ЗаполнитьДокументНаОсновании();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидЗадолженностиПриИзменении(Элемент)
	
	ЗаполнитьДокументНаОсновании();
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаОплатыПриИзменении(Элемент)
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СобственныйКурсОплатыПриИзменении(Элемент)
	
	Объект.КурсОплаты = ?(Объект.СобственныйКурсОплаты, 1, Объект.Дата);
	
КонецПроцедуры

#КонецОбласти

#Область ОБРАБОТЧИКИ_СОБЫТИЙ_ТЧ_ЦЕННЫЕ_БУМАГИ

&НаКлиенте
Процедура ЦенныеБумагиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	РаботаСКорзинойЦенныхБумагКлиентСервер.ЗаполнитьИтоговуюСтроку(Элементы.ИтоговаяСтрокаЦенныеБумаги, Объект.Рынок, Объект.ЦенныеБумаги);

КонецПроцедуры

&НаКлиенте
Процедура ЦенныеБумагиПослеУдаления(Элемент)
	
	РаботаСКорзинойЦенныхБумагКлиентСервер.ЗаполнитьИтоговуюСтроку(Элементы.ИтоговаяСтрокаЦенныеБумаги, Объект.Рынок, Объект.ЦенныеБумаги);

КонецПроцедуры

&НаКлиенте
Процедура ЦенныеБумагиЦеннаяБумагаПриИзменении(Элемент)
	
	ЗаполнитьИнфПоляКорзиныЦенныхБумагНаСервере("ЦенныеБумаги");
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенныеБумагиКоличествоПриИзменении(Элемент)
	
	РаботаСКорзинойЦенныхБумагКлиентСервер.Пересчитать(ЭтаФорма,, "Количество", ЭтаФорма.ВалютаСделки);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенныеБумагиЦенаПроцентПриИзменении(Элемент)
	
	РаботаСКорзинойЦенныхБумагКлиентСервер.Пересчитать(ЭтаФорма,, "ЦенаПроцент", ЭтаФорма.ВалютаСделки);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенныеБумагиЦенаПриИзменении(Элемент)
	
	РаботаСКорзинойЦенныхБумагКлиентСервер.Пересчитать(ЭтаФорма,, "Цена", ЭтаФорма.ВалютаСделки);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенныеБумагиЦенаКупонаПриИзменении(Элемент)
	
	РаботаСКорзинойЦенныхБумагКлиентСервер.Пересчитать(ЭтаФорма,, "ЦенаКупона", ЭтаФорма.ВалютаСделки);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенныеБумагиСуммаПриИзменении(Элемент)
	
	РаботаСКорзинойЦенныхБумагКлиентСервер.Пересчитать(ЭтаФорма,, "Сумма", ЭтаФорма.ВалютаСделки);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенныеБумагиСуммаКупонаПриИзменении(Элемент)
	
	РаботаСКорзинойЦенныхБумагКлиентСервер.Пересчитать(ЭтаФорма,, "СуммаКупона", ЭтаФорма.ВалютаСделки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиПоБухгалтерскомуУчету()

	РаботаСФормамиКлиент.ПровестиПоБухгалтерскомуУчету(ЭтаФорма); 

КонецПроцедуры

&НаКлиенте
Процедура ЗачестьВозвратныйКупонПриИзменении(Элемент)
			
	Элементы.ГруппаВалютаКупона.Видимость = ЭтаФорма.ЗачестьВозвратныйКупон; 
				
	Если ЭтаФорма.ЗачестьВозвратныйКупон Тогда
		Объект.ВалютаЗадолженностиПоКупону = ВалютаОплатыПогашенияКупона(Объект.Основание);
	Иначе		
		Объект.ВозвратныйКупонКЗачету = 0;
		Объект.СуммаЗаймаКПогашениюВВалютеСделки = 0;
		Объект.ВалютаЗадолженностиПоКупону = ПредопределенноеЗначение("Справочник.Валюты.ПустаяСсылка");		
		
		ЭтаФорма.Модифицированность = Истина;				
	КонецЕсли;
	
	ОбновитьВидимостьГруппыСуммаВВалютеСделки();
				
КонецПроцедуры

&НаКлиенте
Процедура ВалютаЗадолженностиПоКупонуПриИзменении(Элемент)
	
	ОбновитьВидимостьГруппыСуммаВВалютеСделки();	
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСДокументамиКлиент.ДатаОбработкаВыбора(Объект, ЭтаФорма, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти
